In [ ]:
#Topic to complete
#1 Statistical Functions
#2 Data Transformations

In [27]:
#importing mportant libraries
import numpy as np
import pandas as pd

In [44]:
#importing data
df =pd.read_csv('Octane.csv')
df.head()

   Sample  Material1  Material2  Material3  Condition  Octane
0       1      55.33       1.72         54    1.66219   92.19
1       2      59.13       1.20         53    1.58399   92.74
2       3      57.39       1.42         55    1.61731   91.88
3       4      56.43       1.78         55    1.66228   92.80
4       5      55.98       1.58         54    1.63195   92.56

In [29]:
#calculating mean for material1,material2,material3conditional and octane
m1_mean=df['Material1'].mean()
m2_mean=df['Material2'].mean()
m3_mean=df['Material3'].mean()
cond_mean = df['Condition'].mean()
octane_mean=df['Octane'].mean()
print('Mean value of material 1 ;',m1_mean)
print('Mean value of material 2 ;',m2_mean)
print('Mean value of material 3 ;',m3_mean)
print('Mean value of Condition :', cond_mean)
print('Mean value of Octane :',octane_mean)

Mean value of material 1 ; 60.17060975609757
Mean value of material 2 ; 1.663658536585366
Mean value of material 3 ; 55.46341463414634
Mean value of Condition : 1.6265713414634146
Mean value of Octane : 91.84987804878045

In [50]:
#calculating mean for material1,material2,material3conditional and octane
m1_mdn=df['Material1'].median()
m2_mdn=df['Material2'].median()
m3_mdn=df['Material3'].median()
cond_mdn = df['Condition'].median()
octane_mdn=df['Octane'].median()
print('Median value of material 1 ;',m1_mdn)
print('Median value of material 2 ;',m2_mdn)
print('Median value of material 3 ;',m3_mdn)
print('Median value of Condition ;', cond_mdn)
print('Median value of Octane ;',octane_mdn)

Median value of material 1 ; 62.695
Median value of material 2 ; 1.28
Median value of material 3 ; 56.0
Median value of Condition ; 1.6035750000000002
Median value of Octane ; 91.735

In [54]:
#simliarly we can use mode function 
#calculating Mode for material1,material2,material3conditional and octane
m1_md=df['Material1'].mode()
m2_md=df['Material2'].mode()
m3_md=df['Material3'].mode()
cond_md=df['Condition'].mode()
octane_md=df['Octane'].mode()
print('Mode value of material 1 :',m1_md)
print('Mode value of material 2 :',m2_md)
print('Mode value of material 3 :',m3_md)
print('Mode value of Condition :',cond_md)
print('Mode value of Octane :',octane_md)

Mode value of material 1 : 0      4.23
1      5.53
2     17.11
3     44.64
4     44.66
      ...
77    72.30
78    72.66
79    73.13
80    73.74
81    75.54
Length: 82, dtype: float64
Mode value of material 2 : 0    0.0
dtype: float64
Mode value of material 3 : 0    55
dtype: int64
Mode value of Condition : 0     1.19975
1     1.20817
2     1.26174
3     1.28802
4     1.29842
       ...
77    2.08081
78    2.14314
79    2.17070
80    2.17140
81    2.31909
Length: 82, dtype: float64
Mode value of Octane : 0    91.56
1    91.61
2    92.16
dtype: float64

In [11]:
#calculating median for material1,material2,material3conditional and octane
m1_cnt=df['Material1'].count()
m2_cnt=df['Material2'].count()
m3_cnt=df['Material3'].count()
cond_cnt = df['Condition'].count()
octane_cnt=df['Octane'].count()
print('Count  value of material 1 ;',m1_cnt)
print('Count  value of material 2 ;',m2_cnt)
print('Count  value of material 3 ;',m3_cnt)
print('Count  value of Condition  :', cond_cnt)
print('Count  value of Octane     :',octane_cnt)

Count  value of material 1 ; 82
Count  value of material 2 ; 82
Count  value of material 3 ; 82
Count  value of Condition  : 82
Count  value of Octane     : 82

In [12]:
#printing the shape
print(df.shape)

(82, 6)

In [14]:
#unique()   :gives you unique values in the column
#nunique()  : number of unique values in the column

In [15]:
#Calculating Standard Deviation  for material1,material2,material3conditional and octane
m1_std=df['Material1'].std()
m2_std=df['Material2'].std()
m3_std=df['Material3'].std()
cond_std = df['Condition'].std()
octane_std=df['Octane'].std()
print('Count  value of material 1 ;',m1_std)
print('Count  value of material 2 ;',m2_std)
print('Count  value of material 3 ;',m3_std)
print('Count  value of Condition  :', cond_std)
print('Count  value of Octane     :',octane_std)

Count  value of material 1 ; 12.43739992552937
Count  value of material 2 ; 1.9019518968064713
Count  value of material 3 ; 5.377582921059387
Count  value of Condition  : 0.2197298227524435
Count  value of Octane     : 1.4011243226995749

In [16]:
#calculate minimun value for material1,material2,material3conditional and octane
m1_min=df['Material1'].min()
m2_min=df['Material2'].min()
m3_min=df['Material3'].min()
cond_min = df['Condition'].min()
octane_min=df['Octane'].min()
print('minimun  value of material 1 ;',m1_min)
print('minimun  value of material 2 ;',m2_min)
print('minimun  value of material 3 ;',m3_min)
print('minimun  value of Condition  :', cond_min)
print('minimun  value of Octane     :',octane_min)

minimun  value of material 1 ; 4.23
minimun  value of material 2 ; 0.0
minimun  value of material 3 ; 40
minimun  value of Condition  : 1.19975
minimun  value of Octane     : 89.66

In [18]:
#calculate maximum value for material1,material2,material3conditional and octane
m1_max=df['Material1'].max()
m2_max=df['Material2'].max()
m3_max=df['Material3'].max()
cond_max = df['Condition'].max()
octane_max=df['Octane'].max()
print('maximum value of material 1 ;',m1_max)
print('maximum value of material 2 ;',m2_max)
print('maximum  value of material 3 ;',m3_max)
print('maximum  value of Condition  :', cond_max)
print('maximum  value of Octane     :',octane_max)

maximum value of material 1 ; 75.54
maximum value of material 2 ; 10.76
maximum  value of material 3 ; 64
maximum  value of Condition  : 2.31909
maximum  value of Octane     : 97.61

In [20]:
#getting all the statistical parameters in one command
df.describe()

          Sample  Material1  Material2  Material3  Condition     Octane
count  82.000000   82.00000  82.000000  82.000000  82.000000  82.000000
mean   41.500000   60.17061   1.663659  55.463415   1.626571  91.849878
std    23.815261   12.43740   1.901952   5.377583   0.219730   1.401124
min     1.000000    4.23000   0.000000  40.000000   1.199750  89.660000
25%    21.250000   55.38000   0.105000  54.000000   1.518095  90.847500
50%    41.500000   62.69500   1.280000  56.000000   1.603575  91.735000
75%    61.750000   67.78000   2.277500  59.750000   1.722818  92.467500
max    82.000000   75.54000  10.760000  64.000000   2.319090  97.610000

In [21]:
#data Transformation

In [89]:
df = pd.read_csv('https://raw.githubusercontent.com/TrainingByPackt/Data-Science-with-Python/master/Chapter01/Data/student.csv',index_col=0)
df.head()

            Age  Gender      Grade Employed
Student_id
1            19    Male  1st Class      yes
2            20  Female  2nd Class       no
3            18    Male  1st Class       no
4            21  Female  2nd Class       no
5            19    Male  1st Class       no

In [90]:
#command to include numeric data type column
df_numeric=df.select_dtypes(include=[np.number])
df_numeric.head()

            Age
Student_id
1            19
2            20
3            18
4            21
5            19

In [91]:
#command to exclude numeric data type column
df_categorical=df.select_dtypes(exclude=[np.number])
df_categorical.head()

            Gender      Grade Employed
Student_id
1             Male  1st Class      yes
2           Female  2nd Class       no
3             Male  1st Class       no
4           Female  2nd Class       no
5             Male  1st Class       no

In [92]:
#getting unique value from grade variable
print(df['Grade'].nunique())
print(df['Grade'].unique())

3
['1st Class' '2nd Class' '3rd Class']

In [93]:
#getting unique value from grade variable
print(df['Gender'].nunique())

2

In [94]:
#getting unique value from grade variable
print(df['Employed'].nunique())

2

In [95]:
#getting prportionate of values in each category in the target variable
df['Grade'].value_counts()

2nd Class    80
3rd Class    80
1st Class    72
Name: Grade, dtype: int64

In [96]:
#getting prportionate of values in each category in the target variable
df['Gender'].value_counts()

Male      136
Female     96
Name: Gender, dtype: int64

In [97]:
#getting prportionate of values in each category in the target variable
df['Employed'].value_counts()

no     133
yes     99
Name: Employed, dtype: int64

In [98]:
#Replacing categorical values with numbers
df['Gender'].replace({'Male': 0, 'Female': 1}, inplace =True)
df['Employed'].replace({'no': 0, 'yes': 1}, inplace =True)
df['Grade'].replace({'1st Class': 1, '2nd Class': 1,'3rd Class': 0}, inplace =True)
df.head()

            Age  Gender  Grade  Employed
Student_id
1            19       0      1         1
2            20       1      1         0
3            18       0      1         0
4            21       1      1         0
5            19       0      1         0

In [99]:
#Basic Data Transformation creating array 
df=pd.DataFrame(np.array([[1,2,3],[4,5,6],[7,8,9]]), columns=['a','b','c'])
df.head()

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [100]:
#applying small transformation
df.transform(func=lambda x :np.log(x))

          a         b         c
0  0.000000  0.693147  1.098612
1  1.386294  1.609438  1.791759
2  1.945910  2.079442  2.197225

In [78]:
#checking the actual data
df.head()

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [79]:
#applying small transformation
df.transform(func=lambda x :10*x)

    a   b   c
0  10  20  30
1  40  50  60
2  70  80  90

In [80]:
#applying small transformation
df.transform(func=lambda x :np.exp(x))

             a            b            c
0     2.718282     7.389056    20.085537
1    54.598150   148.413159   403.428793
2  1096.633158  2980.957987  8103.083928

In [81]:
np.exp(1)

2.718281828459045

In [101]:
#applying small transformation
df.transform(func=lambda x :np.sqrt(x))

          a         b         c
0  1.000000  1.414214  1.732051
1  2.000000  2.236068  2.449490
2  2.645751  2.828427  3.000000